In [2]:
import warnings
warnings.filterwarnings("ignore")

In [10]:
import pandas as pd

clients = pd.read_csv('../input/clients.csv', parse_dates=["joined"])
loans = pd.read_csv('../input/loans.csv', parse_dates=["loan_start", "loan_end"])
payments = pd.read_csv('../input/payments.csv' , parse_dates=["payment_date"])

In [11]:
clients.head(3)

   client_id     joined  income  credit_score
0      46109 2002-04-16  172677           527
1      49545 2007-11-14  104564           770
2      41480 2013-03-11  122607           585

In [12]:
loans.head(3)

,client_id,loan_type,loan_amount,repaid,loan_id,loan_start,loan_end,rate
0,46109,home,13672,0,10243,2002-04-16,2003-12-20,2.15
1,46109,credit,9794,0,10984,2003-10-21,2005-07-17,1.25
2,46109,home,12734,1,10990,2006-02-01,2007-07-05,0.68

In [13]:
payments.head(3)

   loan_id  payment_amount payment_date  missed
0    10243            2369   2002-05-31       1
1    10243            2439   2002-06-18       1
2    10243            2662   2002-06-29       0

In [14]:
import numpy as np
clients["join_month"] = clients["joined"].dt.month
clients["log_income"] = np.log(clients["income"])
clients.head(3)

   client_id     joined  income  credit_score  join_month  log_income
0      46109 2002-04-16  172677           527           4   12.059178
1      49545 2007-11-14  104564           770          11   11.557555
2      41480 2013-03-11  122607           585           3   11.716739

In [15]:
stats = loans.groupby("client_id")["loan_amount"].agg(["mean", "max", "min"])
stats.columns = ["mean_loan_amount", "max_loan_amount", "min_loan_amount"]
stats.head(3)

           mean_loan_amount  max_loan_amount  min_loan_amount
client_id
25707           7963.950000            13913             1212
26326           7270.062500            13464             1164
26695           7824.722222            14865             2389

In [17]:
clients_stats_merge = pd.merge(
    clients,
    stats,
    left_on="client_id",
    right_on="client_id",
    how="left",
)

clients_stats_merge.head(3)

,client_id,joined,income,credit_score,join_month,log_income,mean_loan_amount,max_loan_amount,min_loan_amount
0,46109,2002-04-16,172677,527,4,12.059178,8951.60,14049,559
1,49545,2007-11-14,104564,770,11,11.557555,10289.30,14971,3851
2,41480,2013-03-11,122607,585,3,11.716739,7894.85,14399,811

In [21]:
clients_stats_loans_merge = pd.merge(
    clients_stats_merge,
    loans,
    left_on="client_id",
    right_on="client_id",
    how="left",
)

clients_stats_loans_merge.head(3)

,client_id,joined,income,credit_score,join_month,log_income,mean_loan_amount,max_loan_amount,min_loan_amount,loan_type,loan_amount,repaid,loan_id,loan_start,loan_end,rate
0,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,13672,0,10243,2002-04-16,2003-12-20,2.15
1,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,credit,9794,0,10984,2003-10-21,2005-07-17,1.25
2,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,12734,1,10990,2006-02-01,2007-07-05,0.68

In [22]:
merge_all = pd.merge(
    clients_stats_loans_merge,
    payments,
    left_on="loan_id",
    right_on="loan_id",
    how="left",
)

merge_all.head(3)

,client_id,joined,income,credit_score,join_month,log_income,mean_loan_amount,max_loan_amount,min_loan_amount,loan_type,loan_amount,repaid,loan_id,loan_start,loan_end,rate,payment_amount,payment_date,missed
0,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,13672,0,10243,2002-04-16,2003-12-20,2.15,2369,2002-05-31,1
1,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,13672,0,10243,2002-04-16,2003-12-20,2.15,2439,2002-06-18,1
2,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,13672,0,10243,2002-04-16,2003-12-20,2.15,2662,2002-06-29,0

In [27]:
stats_payment = merge_all.groupby("loan_id")["payment_amount"].agg(
    ["sum", "mean", "max", "min", "std", "var"]
)

stats_payment.columns = [
    "sum_payment_amount",
    "mean_payment_amount",
    "max_payment_amount",
    "min_payment_amount",
    "std_payment_amount",
    "var_payment_amount",
]

stats_payment.head(3)

,sum_payment_amount,mean_payment_amount,max_payment_amount,min_payment_amount,std_payment_amount,var_payment_amount
loan_id,,,,,,
10009,1996,332.666667,394,280,46.915527,2201.066667
10017,9432,1179.000000,1446,994,155.324545,24125.714286
10024,6345,705.000000,895,518,141.412517,19997.500000

In [29]:
merge_all_add_newft = pd.merge(
    merge_all,
    stats_payment,
    left_on="loan_id",
    right_on="loan_id",
    how="left",
)

merge_all_add_newft.head(3)

,client_id,joined,income,credit_score,join_month,log_income,mean_loan_amount,max_loan_amount,min_loan_amount,loan_type,...,rate,payment_amount,payment_date,missed,sum_payment_amount,mean_payment_amount,max_payment_amount,min_payment_amount,std_payment_amount,var_payment_amount
0,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,...,2.15,2369,2002-05-31,1,14008,2334.666667,2662,2027,212.940054,45343.466667
1,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,...,2.15,2439,2002-06-18,1,14008,2334.666667,2662,2027,212.940054,45343.466667
2,46109,2002-04-16,172677,527,4,12.059178,8951.6,14049,559,home,...,2.15,2662,2002-06-29,0,14008,2334.666667,2662,2027,212.940054,45343.466667

In [28]:
import featuretools as ft

In [30]:
es = ft.EntitySet(id="clients")